
#     Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
#     Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)


a = int (4)

number_pr=1
print('[',end=" ")
for i in range(a):
    number_pr=number_pr*(i+1)
    print(f'{number_pr},', end=" ")
print("]",end=" ")
b=[]
b.insert(0,'(1,1*2,1*2*3,1*2*3*4)')
print(*b)







